posts/Nicotine.org
#+title: Nicotine
#+title_extra: those darn pouches
#+post_type: post
#+filetags:
#+pubdate: <2024-12-30>

A few times this year, I've fallen prey to those little nicotine pouches (velo).
Nicotine is awesome for about a week, and then the experience flips and you find
yourself in a limbo where you must increase the dose to experience the same
effects -- subjectively it also feels like you swap from an "up" feeling to a
"relaxed" feeling when taking it.

Here's my personal reasons to not do it:

- stuffy nose all the time
- makes caffeine less effective
- messes with sleep
- irritates the bowels
- damages the gums
- it's impossible (for me) to use in moderation
- "nic sick" can make you feel heavy, lethargic
