nicotine.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nicotine</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="Nicotine">
<meta property="og:description" content="those darn pouches">
<meta property="og:image" content="https://notes.neeasade.net/assets/posts/ca_dump3/3a021bfa0eb77c30fa45326bbbed32204329fa49119a718dc9270e4f25f0ab43.png">
<meta property="og:url" content="https://notes.neeasade.net/nicotine">
<meta property="description" content="those darn pouches">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='./assets/css/colors.css?sum=cbc7f86dcba5597749ac3221baabf396'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=de2a5435182495e691565c7d598903bd'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=4585bf9e4d5692e92670ff113acbae90'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='./index.html'>../notes</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/Nicotine.org">source</a>
</div>
<h1 class=title>
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
    Nicotine
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
</h1>
<div class="org-center">
<p>
those darn pouches
</p>
</div>
<span class=pubinfo>
    Published 2024-12-30,
    last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/Nicotine.org">2025-06-20</a>
</span>
<div class="posttags"> <a href='./tag-sleep.html'>#sleep</a> </div>
</header>
<hr>
<p>
A few times this year, I&rsquo;ve fallen prey to those little nicotine pouches (velo).
Nicotine is awesome for about a week, and then the experience flips and you find
yourself in a limbo where you must increase the dose to experience the same
effects &#x2013; subjectively it also feels like you swap from an &ldquo;up&rdquo; feeling to a
&ldquo;relaxed&rdquo; feeling when taking it.
</p>

<p>
Here&rsquo;s my personal reasons to not do it:
</p>

<ul class="org-ul">
<li>stuffy nose all the time</li>
<li>makes caffeine less effective</li>
<li>messes with sleep</li>
<li>irritates the bowels</li>
<li>damages the gums</li>
<li>it&rsquo;s impossible (for me) to use in moderation</li>
<li>&ldquo;nic sick&rdquo; can make you feel heavy, lethargic</li>
</ul>

<footer>
    <div style="float: left">
         <a href='warcraft-iii-1.21b-hd.html'>newer: Warcraft III Resolution Fix</a> 
    </div>
    <div style="text-align: right">
         <a href='rice-slop.html'>older: rice slop</a> 
    </div>
</footer>
<hr>
</main>
</body>
</html>
